# 특정컬럼

In [1]:
import pandas as pd
data = [['김민재', 27, 75, 5428000],
        ['이강인', 22, 57, 3428000],
        ['박찬호', 50, 91, 8428000],
        ['차범근', 70, 80, 4428000],
        ['추신수', 43, 100, 4528000],
        ['손흥민', 31, 72, 7028000],
        ['황희찬', 28, 69, 2528000]]

df = pd.DataFrame(data, columns=['성명', '나이', '몸무게', '급여'])
df

    성명  나이  몸무게       급여
0  김민재  27   75  5428000
1  이강인  22   57  3428000
2  박찬호  50   91  8428000
3  차범근  70   80  4428000
4  추신수  43  100  4528000
5  손흥민  31   72  7028000
6  황희찬  28   69  2528000

특정 컬럼만 표시

In [2]:
df[['성명', '나이', '급여']]

    성명  나이       급여
0  김민재  27  5428000
1  이강인  22  3428000
2  박찬호  50  8428000
3  차범근  70  4428000
4  추신수  43  4528000
5  손흥민  31  7028000
6  황희찬  28  2528000

In [3]:
df[['성명']]

    성명
0  김민재
1  이강인
2  박찬호
3  차범근
4  추신수
5  손흥민
6  황희찬

In [4]:
df[['성명', '급여']]

    성명       급여
0  김민재  5428000
1  이강인  3428000
2  박찬호  8428000
3  차범근  4428000
4  추신수  4528000
5  손흥민  7028000
6  황희찬  2528000

# 특정 행만

In [5]:
df.loc[0]     # 시리즈 형태로 표시한다.

성명         김민재
나이          27
몸무게         75
급여     5428000
Name: 0, dtype: object

In [6]:
df.loc[[1,3,6]]     # 데이터프레임 형태로 표시한다.

    성명  나이  몸무게       급여
1  이강인  22   57  3428000
3  차범근  70   80  4428000
6  황희찬  28   69  2528000

In [7]:
df.loc[[0,1,2]]     # 지정한 대로 여러 행을 한꺼번에 보려면 대괄호를 포함해야 한다.

    성명  나이  몸무게       급여
0  김민재  27   75  5428000
1  이강인  22   57  3428000
2  박찬호  50   91  8428000

In [8]:
# 인덱스 0번 행에서 인덱스 3번 행 까지의 데이터 4개를 표시한다.
df.loc[2:4]

    성명  나이  몸무게       급여
2  박찬호  50   91  8428000
3  차범근  70   80  4428000
4  추신수  43  100  4528000

# 행, 열 형태로 표시

In [9]:
df.loc[0, '성명']     # 시리즈 형태로 '김민재' 를 표시한다.

'김민재'

In [10]:
df.loc[[0], ['성명']]     # 데이터프레임 형태로 '김민재' 를 표시한다.

    성명
0  김민재

In [11]:
df.loc[[0,1], ['성명']]     # 데이터프레임 형태로 표시한다.

    성명
0  김민재
1  이강인

In [12]:
df.loc[[0,2], ['성명','나이']]

    성명  나이
0  김민재  27
2  박찬호  50

In [13]:
df.loc[0:3, '성명':'급여']

    성명  나이  몸무게       급여
0  김민재  27   75  5428000
1  이강인  22   57  3428000
2  박찬호  50   91  8428000
3  차범근  70   80  4428000

# 숫자로 인덱싱과 슬라이싱

In [14]:
df.loc[0, '급여']     # .loc는 인덱싱할 컬럼을 '급여'로 입력해야 한다.

np.int64(5428000)

In [15]:
df.iloc[0, 3]     # .iloc는 인덱싱할 컬럼을 숫자로 입력한다.

np.int64(5428000)

In [16]:
df.loc[[0,1,2], ['성명','급여']]

    성명       급여
0  김민재  5428000
1  이강인  3428000
2  박찬호  8428000

In [17]:
df.iloc[::1, 0:3]

    성명  나이  몸무게
0  김민재  27   75
1  이강인  22   57
2  박찬호  50   91
3  차범근  70   80
4  추신수  43  100
5  손흥민  31   72
6  황희찬  28   69

In [18]:
df.iloc[:, :]

    성명  나이  몸무게       급여
0  김민재  27   75  5428000
1  이강인  22   57  3428000
2  박찬호  50   91  8428000
3  차범근  70   80  4428000
4  추신수  43  100  4528000
5  손흥민  31   72  7028000
6  황희찬  28   69  2528000

# 조건에 맞는 데이터 표시

조건문으로 True/False

In [19]:
(df['급여'] >= 5000000)

0     True
1    False
2     True
3    False
4    False
5     True
6    False
Name: 급여, dtype: bool

In [20]:
(df['급여'] >= 5000000) | (df['나이'] < 40)

0     True
1     True
2     True
3    False
4    False
5     True
6     True
dtype: bool

In [21]:
(df['급여'] >= 5000000) & (df['몸무게'] > 70) & (df['나이'] < 50)

0     True
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

조건에 맞는 행, 열만 표시

In [22]:
(df['급여'] >= 5000000)

0     True
1    False
2     True
3    False
4    False
5     True
6    False
Name: 급여, dtype: bool

In [23]:

df.loc[df['급여'] >= 5000000]

    성명  나이  몸무게       급여
0  김민재  27   75  5428000
2  박찬호  50   91  8428000
5  손흥민  31   72  7028000

In [24]:
df

    성명  나이  몸무게       급여
0  김민재  27   75  5428000
1  이강인  22   57  3428000
2  박찬호  50   91  8428000
3  차범근  70   80  4428000
4  추신수  43  100  4528000
5  손흥민  31   72  7028000
6  황희찬  28   69  2528000

In [25]:
df.loc[(df['나이'] >= 25) & (df['나이'] <= 30)]

    성명  나이  몸무게       급여
0  김민재  27   75  5428000
6  황희찬  28   69  2528000

In [26]:
df.loc[df['급여'] > 5000000, ['성명']]

    성명
0  김민재
2  박찬호
5  손흥민

In [27]:
df['비고'] = ' '    # 새로운 컬럼에 데이터를 입력 df['비고'] = '정상'
df

    성명  나이  몸무게       급여 비고
0  김민재  27   75  5428000
1  이강인  22   57  3428000
2  박찬호  50   91  8428000
3  차범근  70   80  4428000
4  추신수  43  100  4528000
5  손흥민  31   72  7028000
6  황희찬  28   69  2528000

In [28]:
df.loc[df['몸무게'] > 80, ['비고']]

  비고
2
4

새로운 '체질량' 컬럼을 추가하고 특정 조건에는 특정 값을 지정

In [29]:
df.loc[df['몸무게'] > 80, ['체질량']] = '비만'
df

    성명  나이  몸무게       급여 비고  체질량
0  김민재  27   75  5428000     NaN
1  이강인  22   57  3428000     NaN
2  박찬호  50   91  8428000      비만
3  차범근  70   80  4428000     NaN
4  추신수  43  100  4528000      비만
5  손흥민  31   72  7028000     NaN
6  황희찬  28   69  2528000     NaN